In [1]:
import pandas as pd
import numpy as np

# Dataframes in python
*Pandas is an open source library built on top of numpy<br>
*It is used in data cleaning and preparation<br>
*It has an ability to work with data from different sources

In [2]:
index = ['a', 'b', 'c']
numbers= [1,2,3]
np.array(numbers)

array([1, 2, 3])

In [3]:
#Creating pandas series from a list
pd.Series(data= numbers)

0    1
1    2
2    3
dtype: int64

In [4]:
#creating series by specifying the index.
pd.Series(data= numbers, index= index)

a    1
b    2
c    3
dtype: int64

In [5]:
#making series with the help of a dictionary
#It sets keys as the index and values to th corresponding data point.
my_dictionary= {'Apple': 'Iphone', 'Samsung': 'Galaxy', 'One_Plus': '7 Pro'}
my_series= pd.Series(my_dictionary)
my_series

Apple       Iphone
Samsung     Galaxy
One_Plus     7 Pro
dtype: object

In [6]:
#Indexing in series is same as numpy arrays
my_series['Apple']

'Iphone'

In [7]:
my_series[2]

'7 Pro'

# Dataframes in Pandas

In [8]:
#creating a dataframe in pandas
#columns attribute is used to mention the name of the columns
#index attribute is used to mention the name of the rows/index
df= pd.DataFrame(data=np.random.randint(0,100,20).reshape(5,4), columns= ["col1","col2","col3","col4",], index= ['row1','row2','row3','row4','row5'])
df

      col1  col2  col3  col4
row1    63    75    11    21
row2    69    71     5    13
row3    13    18    88    82
row4    99    42     6    11
row5    49    12    84    69

In [9]:
#calling a single column
df['col1']

row1    63
row2    69
row3    13
row4    99
row5    49
Name: col1, dtype: int32

In [10]:
#to call number of columns, pass list of columns in df
df[['col1','col2']]

      col1  col2
row1    63    75
row2    69    71
row3    13    18
row4    99    42
row5    49    12

In [11]:
#calling a row in a dataframe
df.loc['row2']

col1    69
col2    71
col3     5
col4    13
Name: row2, dtype: int32

In [12]:
#calling a particular element in a dataframe
df.loc['row4','col3']

6

In [13]:
#slicing in dataframe
df.loc['row1':'row2','col1':'col2']

      col1  col2
row1    63    75
row2    69    71

In [14]:
#each column represents a pandas series
type(df['col1'])

pandas.core.series.Series

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
#Adding new columns in an existing dataframe.
df['my_new_column']= df['col1'] + df['col2']
df

      col1  col2  col3  col4  my_new_column
row1    63    75    11    21            138
row2    69    71     5    13            140
row3    13    18    88    82             31
row4    99    42     6    11            141
row5    49    12    84    69             61

In [17]:
#removing column from a dataframe
#You need to specify axis in the drop function, 0 is for rows, 1 refers columns
df.drop('my_new_column', axis=1, inplace=True)
df

      col1  col2  col3  col4
row1    63    75    11    21
row2    69    71     5    13
row3    13    18    88    82
row4    99    42     6    11
row5    49    12    84    69

In [18]:
#removing rows from a dataframe
df.drop('row5', inplace=True)

In [19]:
df

      col1  col2  col3  col4
row1    63    75    11    21
row2    69    71     5    13
row3    13    18    88    82
row4    99    42     6    11